squre_cylinder/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.01;

vertices
(    
    (0  0   0)//0
    (18  0  0) //1
    (20  0  0)//2
    (21  0  0)//3
    (23  0 0)//4
    (60  0  0)//5
    (0  17.5   0)//6
    (18  17.5  0) //7
    (20  17.5  0)//8
    (21  17.5  0)//9
    (23  17.5 0)//10
    (60  17.5  0)//11
    (0  19.5   0)//12
    (18  19.5  0) //13
    (20  19.5  0)//14
    (21  19.5  0)//15
    (23  19.5 0)//16
    (60  19.5  0)//17
    (0  20.5   0)//18
    (18  20.5  0) //19
    (20  20.5  0)//20
    (21  20.5  0)//21
    (23  20.5 0)//22
    (60  20.5  0)//23
    (0  22.5   0)//24
    (18  22.5  0) //25
    (20  22.5  0)//26
    (21  22.5  0)//27
    (23  22.5 0)//28
    (60  22.5  0)//29
    (0  40   0)//30
    (18  40  0) //31
    (20  40  0)//32
    (21  40  0)//33
    (23  40 0)//34
    (60  40 0)//35
	
    (0  0   0.1)//36
    (18  0  0.1) //37
    (20  0  0.1)//38
    (21  0  0.1)//39
    (23  0  0.1)//40
    (60  0  0.1)//41
    (0  17.5   0.1)//42
    (18  17.5  0.1) //43
    (20  17.5  0.1)//44
    (21  17.5  0.1)//45
    (23  17.5  0.1)//46
    (60  17.5  0.1)//47
    (0  19.5   0.1)//48
    (18  19.5  0.1) //49
    (20  19.5  0.1)//50
    (21  19.5  0.1)//51
    (23  19.5 0.1)//52
    (60  19.5  0.1)//53
    (0  20.5   0.1)//54
    (18  20.5  0.1) //55
    (20  20.5  0.1)//56
    (21  20.5  0.1)//57
    (23  20.5 0.1)//58
    (60  20.5  0.1)//59
    (0  22.5   0.1)//60
    (18  22.5  0.1) //61
    (20  22.5  0.1)//62
    (21  22.5  0.1)//63
    (23  22.5 0.1)//64
    (60  22.5  0.1)//65
    (0  40   0.1)//66
    (18  40  0.1) //67
    (20  40  0.1)//68
    (21  40  0.1)//69
    (23  40 0.1)//70
    (60  40 0.1)//71



);

blocks
(
    hex (1 7 6 0 37 43 42 36) (175 180 1) simpleGrading (-3 3 1)
    hex (2 8 7 1 38 44 43 37) (175 20 1)  simpleGrading (-3 1 1)
    hex (3 9 8 2 39 45 44 38) (175 10 1) simpleGrading (-3 1 1)
    hex (4 10 9 3 40 46 45 39) (175 20 1) simpleGrading (-3 1 1)
    hex (5 11 10 4 41 47 46 40) (175 370 1) simpleGrading (-3 -3 1)

    hex (7 13 12 6 43 49 48 42) (20 180 1) simpleGrading (1 3 1)
    hex (8 14 13 7 44 50 49 43) (20 20 1) simpleGrading (1 1 1)
    hex (9 15 14 8 45 51 50 44) (20 10 1) simpleGrading (1 1 1)
    hex (10 16 15 9 46 52 51 45) (20 20 1) simpleGrading (1 1 1)
    hex (11 17 16 10 47 53 52 46) (20 370 1) simpleGrading (1 -3 1)
   
    hex (13 19 18 12 49 55 54 48) (10 180 1) simpleGrading (1 3 1)
    hex (14 20 19 13 50 56 55 49) (10 20 1) simpleGrading (1 1 1)
    hex (16 22 21 15 52 58 57 51) (10 20 1) simpleGrading (1 1 1)
    hex (17 23 22 16 53 59 58 52) (10 370 1) simpleGrading (1 -3 1)
	
    hex (19 25 24 18 55 61 60 54) (20 180 1) simpleGrading (1 3 1)
    hex (20 26 25 19 56 62 61 55) (20 20 1) simpleGrading (1 1 1)
    hex (21 27 26 20 57 63 62 56) (20 10 1) simpleGrading (1 1 1)
    hex (22 28 27 21 58 64 63 57) (20 20 1) simpleGrading (1 1 1)
    hex (23 29 28 22 59 65 64 58) (20 370 1) simpleGrading (1 -3 1)

    hex (25 31 30 24 61 67 66 60) (175 180 1) simpleGrading (3 3 1)
    hex (26 32 31 25 62 68 67 61) (175 20 1)  simpleGrading (3 1 1)
    hex (27 33 32 26 63 69 68 62) (175 10 1) simpleGrading (3 1 1)
    hex (28 34 33 27 64 70 69 63) (175 20 1) simpleGrading (3 1 1)
    hex (29 35 34 28 65 71 70 64) (175 370 1) simpleGrading (3 -3 1)

 

);

boundary
(
    inlet
    {
        type patch;
        faces
        (
         (24 60 66 30)
	 (18 54 60 24)
	 (12 48 54 18)
	 (6 42 48 12)
	 (0 36 42 6)
        );
    }

    outlet
    {
        type patch;
        faces
        (
	 (29 35 71 65)
	 (23 29 65 59)
	 (17 23 59 53)
	 (11 17 53 47)
	 (5 11 47 41)
        );
    }

    bottom
    {
        type symmetry;
        faces
        (
         (0 36 37 1)
	 (1 37 38 2)
	 (2 38 39 3)
	 (3 39 40 4)
	 (4 40 41 5)  
        );
    }

    top
    {
        type symmetry;
        faces
        (
         (30 66 67 31)
	 (31 67 68 32)
	 (32 68 69 33)
	 (33 69 70 34)
	 (34 70 71 35)
        );
    }

    cylinder
    {
       type wall;
       faces
       (
         (20 56 57 21)
         (14 50 51 15)
         (15 21 57 51)
         (14 50 56 20)
       );
    }

    frontAndBack
    {
        type empty;
        faces
        (
        (1 7 6 0) 
        (37 43 42 36)
        (2 8 7 1) 
	(38 44 43 37) 
        (3 9 8 2) 
	(39 45 44 38) 
        (4 10 9 3)  
	(40 46 45 39) 
        (5 11 10 4) 
	(41 47 46 40) 

        (7 13 12 6) 
	(43 49 48 42) 
        (8 14 13 7) 
	(44 50 49 43) 
        (9 15 14 8) 
	(45 51 50 44) 
        (10 16 15 9) 
	(46 52 51 45) 
        (11 17 16 10) 
	(47 53 52 46) 
   
        (13 19 18 12) 
	(49 55 54 48) 
        (14 20 19 13) 
	(50 56 55 49) 
        (16 22 21 15) 
	(52 58 57 51) 
        (17 23 22 16) 
	(53 59 58 52) 
	
        (19 25 24 18) 
	(55 61 60 54) 
        (20 26 25 19) 
	(56 62 61 55) 
        (21 27 26 20) 
	(57 63 62 56) 
        (22 28 27 21) 
	(58 64 63 57) 
        (23 29 28 22) 
	(59 65 64 58) 

        (25 31 30 24) 
	(61 67 66 60) 
        (26 32 31 25) 
	(62 68 67 61) 
        (27 33 32 26) 
	(63 69 68 62)
        (28 34 33 27) 
	(64 70 69 63) 
        (29 35 34 28) 
	(65 71 70 64) 


        );
    }
);


// ************************************************************************* //

